app/Http/Controllers/CursoController.php

    public function index(){
        $cursos = Curso::orderBy('id','desc')->paginate();
---
select * from `cursos` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `cursos`

    public function store(StoreCurso $request){
        // $curso = new Curso();
        // $curso->name = $request->name;
        // $curso->description = $request->description;
        // $curso->categoria = $request->categoria;
        // $curso->save();

        $curso = Curso::create($request->all());
---
insert into `cursos` (`name`, `slug`, `description`, `categoria`, `updated_at`, `created_at`) values ('admin', 'nota-dev', 'blabla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla', 'Diamante', '2023-10-27 16:46:59', '2023-10-27 16:46:59')

    public function update(Request $request, Curso $curso){

        $request->validate([
            'name' => ['required','min:3'],
            'slug' => 'required|unique:cursos,slug,' . $curso->id . '|min:3',
            'description' => 'required|min:10',
            'categoria' => 'required'
        ]);

        // $curso->name = $request->name;
        // $curso->description = $request->description;
        // $curso->categoria = $request->categoria;
        // $curso->save();

        $curso->update($request->all());
---
update `cursos` set `description` = 'Porro fuga aspernatur eveniet corporis ea aut. Quia commodi odit vel sint. Incidunt et minima ipsa fuga et. Tempora et sint aut. nx', `cursos`.`updated_at` = '2023-10-27 16:46:14' where `id` = 42